[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:18:18
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
 export default function GEAreaTable({ generalEducation }) {
-  const testid = "GEAreaTable";
+  const testid = "";
 
   const columns = [
killedBy: GEAreaTable tests cannot expand rows with no sub rows
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid=""

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:23:15
   const columns = [
     {
       id: "expander", // Unique ID for the expander column
-      header: ({ table }) => (
-        <button
-          data-testid={`${testid}-expand-all-rows`}
-          {...{
-            onClick: table.getToggleAllRowsExpandedHandler(),
-          }}
-        >
-          {table.getIsAllRowsExpanded() ? "➖" : "➕"}
-        </button>
-      ),
+      header: () => undefined,
       cell: ({ row }) =>
         row.getCanExpand() ? (
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an element by: [data-testid="GEAreaTable-expand-all-rows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="GEAreaTable"

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:25:24
       id: "expander", // Unique ID for the expander column
       header: ({ table }) => (
         <button
-          data-testid={`${testid}-expand-all-rows`}
+          data-testid={``}
           {...{
             onClick: table.getToggleAllRowsExpandedHandler(),
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an element by: [data-testid="GEAreaTable-expand-all-rows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="GEAreaTable"

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:33:13
           {table.getIsAllRowsExpanded() ? "➖" : "➕"}
         </button>
       ),
-      cell: ({ row }) =>
-        row.getCanExpand() ? (
-          <button
-            data-testid={`${testid}-row-${row.index}-expand-button`}
-            {...{
-              onClick: row.getToggleExpandedHandler(),
-              style: { cursor: "pointer" },
-            }}
-          >
-            {row.getIsExpanded() ? "➖" : "➕"}
-          </button>
-        ) : (
-          <span data-testid={`${testid}-row-${row.index}-cannot-expand`} />
-        ),
+      cell: () => undefined,
       // This is important for indenting sub-rows
       // We'll apply this style in the render, but you can define it here too
killedBy: GEAreaTable tests cannot expand rows with no sub rows
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="GEAreaTable"

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaTable.jsx:37:17
         row.getCanExpand() ? (
           <button
             data-testid={`${testid}-row-${row.index}-expand-button`}
-            {...{
-              onClick: row.getToggleExpandedHandler(),
-              style: { cursor: "pointer" },
-            }}
+            {...{}}
           >
             {row.getIsExpanded() ? "➖" : "➕"}
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaTable.jsx:39:22
             data-testid={`${testid}-row-${row.index}-expand-button`}
             {...{
               onClick: row.getToggleExpandedHandler(),
-              style: { cursor: "pointer" },
+              style: {},
             }}
           >
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:42:36
               style: { cursor: "pointer" },
             }}
           >
-            {row.getIsExpanded() ? "➖" : "➕"}
+            {row.getIsExpanded() ? "" : "➕"}
           </button>
         ) : (
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ➖
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:42:42
               style: { cursor: "pointer" },
             }}
           >
-            {row.getIsExpanded() ? "➖" : "➕"}
+            {row.getIsExpanded() ? "➖" : ""}
           </button>
         ) : (
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ➕
Received:

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:45:30
             {row.getIsExpanded() ? "➖" : "➕"}
           </button>
         ) : (
-          <span data-testid={`${testid}-row-${row.index}-cannot-expand`} />
+          <span data-testid={``} />
         ),
       // This is important for indenting sub-rows
killedBy: GEAreaTable tests cannot expand rows with no sub rows
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="GEAreaTable"

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:52:15
       // For sub-rows, you might want to adjust cell content for clarity
     },
     {
-      header: "Quarter",
+      header: "",
       accessorKey: "quarter",
       cell: ({ row }) =>
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Quarter"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:53:20
     },
     {
       header: "Quarter",
-      accessorKey: "quarter",
+      accessorKey: "",
       cell: ({ row }) =>
         row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
killedBy: GeneralEducationSearchPage tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="GEAreaTable-cell-row-0-col-quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:54:13
     {
       header: "Quarter",
       accessorKey: "quarter",
-      cell: ({ row }) =>
-        row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  F24
Received:

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:59:15
     },
     {
       accessorKey: "courseId",
-      header: "Course ID",
+      header: "",
       cell: ({ row }) => {
         return renderDetailPageLink(row, testid);
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Course ID"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] BlockStatement
main/components/GEAreas/GEAreaTable.jsx:60:26
     {
       accessorKey: "courseId",
       header: "Course ID",
-      cell: ({ row }) => {
-        return renderDetailPageLink(row, testid);
-      },
+      cell: ({ row }) => {},
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-col-detail-link"]

Ignored nodes: comments, script, style
<td
  data-testid="GEAreaTable-cell-row-0-col-courseId"
  style="background-color: inherit; font-weight: bold;"
/>

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:66:15
     },
     {
       accessorKey: "title",
-      header: "Title",
+      header: "",
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Title"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaTable.jsx:68:5
       accessorKey: "title",
       header: "Title",
     },
-    {
-      header: "Status",
-      accessorKey: "status",
-      cell: ({ row }) => formatStatus(getSection(row)),
-    },
+    {},
     {
       header: "Enrolled",
killedBy: GEAreaTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:71:13
     {
       header: "Status",
       accessorKey: "status",
-      cell: ({ row }) => formatStatus(getSection(row)),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:76:13
     {
       header: "Enrolled",
       accessorKey: "enrolled",
-      cell: ({ row }) => enrollmentFraction(row),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  172/175
Received:

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:81:13
     {
       id: "location",
       header: "Location",
-      cell: ({ row }) => formatLocation(getSection(row).timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ILP 2101
Received:

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaTable.jsx:83:5
       header: "Location",
       cell: ({ row }) => formatLocation(getSection(row).timeLocations),
     },
-    {
-      id: "days",
-      header: "Days",
-      cell: ({ row }) => formatDays(getSection(row).timeLocations),
-    },
+    {},
     {
       id: "time",
killedBy: GEAreaTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:85:15
     },
     {
       id: "days",
-      header: "Days",
+      header: "",
       cell: ({ row }) => formatDays(getSection(row).timeLocations),
     },
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Days"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:86:13
     {
       id: "days",
       header: "Days",
-      cell: ({ row }) => formatDays(getSection(row).timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  M W F
Received:

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:91:13
     {
       id: "time",
       header: "Time",
-      cell: ({ row }) => formatTime(getSection(row).timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expected '' to match /8:00.*8:50/i

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaTable.jsx:93:5
       header: "Time",
       cell: ({ row }) => formatTime(getSection(row).timeLocations),
     },
-    {
-      id: "instructor",
-      header: "Instructor",
-      cell: ({ row }) => formatInstructors(getSection(row).instructors),
-    },
+    {},
     {
       accessorKey: "enrollCode",
killedBy: GEAreaTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:96:13
     {
       id: "instructor",
       header: "Instructor",
-      cell: ({ row }) => formatInstructors(getSection(row).instructors),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  PORTER M J
Received:

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:100:15
     },
     {
       accessorKey: "enrollCode",
-      header: "Enroll Code",
+      header: "",
       cell: ({ row }) => getSectionField(row, "enrollCode"),
     },
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Enroll Code"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:101:13
     {
       accessorKey: "enrollCode",
       header: "Enroll Code",
-      cell: ({ row }) => getSectionField(row, "enrollCode"),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  30247
Received:

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:101:47
     {
       accessorKey: "enrollCode",
       header: "Enroll Code",
-      cell: ({ row }) => getSectionField(row, "enrollCode"),
+      cell: ({ row }) => getSectionField(row, ""),
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  30247
Received:

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:104:15
       cell: ({ row }) => getSectionField(row, "enrollCode"),
     },
     {
-      header: "Info",
+      header: "",
       id: "info",
       cell: ({ row }) => renderInfoLink(row, testid),
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Info"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:106:13
     {
       header: "Info",
       id: "info",
-      cell: ({ row }) => renderInfoLink(row, testid),
+      cell: () => undefined,
     },
   ];
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-col-info-link"]

Ignored nodes: comments, script, style
<td
  data-testid="GEAreaTable-cell-row-0-col-info"
  style="background-color: inherit; font-weight: bold;"
/>
