[Killed] ArrowFunction
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:10:31
 export default function GeneralEducationSearchPage() {
   const [generalEducationJSON, setGeneralEducationJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/primariesge",
-    params: {
-      qtr: query.quarter,
-      area: query.area,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (generalEducation) => {
killedBy: GeneralEducationSearchPage tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:10:43
 export default function GeneralEducationSearchPage() {
   const [generalEducationJSON, setGeneralEducationJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/primariesge",
-    params: {
-      qtr: query.quarter,
-      area: query.area,
-    },
-  });
+  const objectToAxiosParams = (query) => ({});
 
   const onSuccess = (generalEducation) => {
killedBy: GeneralEducationSearchPage tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:12:13
 
   const objectToAxiosParams = (query) => ({
     url: "/api/public/primariesge",
-    params: {
-      qtr: query.quarter,
-      area: query.area,
-    },
+    params: {},
   });
 
killedBy: GeneralEducationSearchPage tests primariesge GET uses qtr and area in the backend call
statusReason: expected {} to deeply equal { qtr: '20221', area: 'ALL' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:18:43
     },
   });
 
-  const onSuccess = (generalEducation) => {
-    setGeneralEducationJSON(generalEducation);
-  };
+  const onSuccess = (generalEducation) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
killedBy: GeneralEducationSearchPage tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:24:59
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
 
-  async function fetchGeneralEducationJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchGeneralEducationJSON(_event, query) {}
   return (
     <BasicLayout>
killedBy: GeneralEducationSearchPage tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="GEAreaTable-row-0-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
