[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:12:53
   convertToFraction,
 } from "main/utils/sectionUtils.jsx";
 
-function ConvertedSectionTable({ sections, testid = "ConvertedSectionTable" }) {
+function ConvertedSectionTable({ sections, testid = "" }) {
   const columns = [
     {
killedBy: ConvertedSectionTable tests renders with expected headers
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:14:5
 
 function ConvertedSectionTable({ sections, testid = "ConvertedSectionTable" }) {
   const columns = [
-    {
-      header: "Quarter",
-      accessorKey: "quarter",
-      cell: ({ row }) => yyyyqToQyy(row.original.courseInfo.quarter),
-    },
+    {},
     {
       header: "CourseId",
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:24:5
       accessorKey: "courseId",
       cell: ({ row }) => row.original.courseInfo.courseId,
     },
-    {
-      header: "Title",
-      accessorKey: "title",
-      cell: ({ row }) => row.original.courseInfo.title,
-    },
+    {},
     {
       header: "EnrollCd",
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:34:5
       accessorKey: "enrollCode",
       cell: ({ row }) => row.original.section.enrollCode,
     },
-    {
-      header: "Status",
-      accessorKey: "status",
-      cell: ({ row }) => formatStatus(row.original.section),
-    },
+    {},
     {
       header: "Enrolled",
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:41:20
     },
     {
       header: "Enrolled",
-      accessorKey: "enrolled",
+      accessorKey: "",
       cell: ({ row }) =>
         convertToFraction(
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:53:5
       accessorKey: "days",
       cell: ({ row }) => formatDays(row.original.section.timeLocations),
     },
-    {
-      header: "Time",
-      accessorKey: "time",
-      cell: ({ row }) => formatTime(row.original.section.timeLocations),
-    },
+    {},
     {
       header: "Location",
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:68:5
       accessorKey: "instructors",
       cell: ({ row }) => formatInstructors(row.original.section.instructors),
     },
-    {
-      header: "Section",
-      accessorKey: "section",
-      cell: ({ row }) => row.original.section.section,
-    },
+    {},
     {
       header: "Session",
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:76:26
     {
       header: "Session",
       accessorKey: "session",
-      cell: ({ row }) => row.original.section.session?.[5] || "",
+      cell: ({ row }) => false,
     },
   ];
killedBy: ConvertedSectionTable tests renders session value from session[5]
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] LogicalOperator
main/components/Common/ConvertedSectionTable.jsx:76:26
     {
       header: "Session",
       accessorKey: "session",
-      cell: ({ row }) => row.original.section.session?.[5] || "",
+      cell: ({ row }) => row.original.section.session?.[5] && "",
     },
   ];
killedBy: ConvertedSectionTable tests renders session value from session[5]
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:
