[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:14:20
   // for the first and last values in the dropdown lists, with the actual
   // *currently selectted* start and end quarters for the search!
 
-  const firstQtr = systemInfo.startQtrYYYYQ || "20211";
+  const firstQtr = systemInfo.startQtrYYYYQ && "20211";
   const lastQtr = systemInfo.endQtrYYYYQ || "20214";
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: Value "20201" not found in options

Ignored nodes: comments, script, style
<select
  class="form-control"
  data-testid="CourseOverTimeDescriptionSearch.StartQuarter"
  id="CourseOverTimeDescriptionSearch.StartQuarter"
>

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:14:20
   // for the first and last values in the dropdown lists, with the actual
   // *currently selectted* start and end quarters for the search!
 
-  const firstQtr = systemInfo.startQtrYYYYQ || "20211";
+  const firstQtr = true;
   const lastQtr = systemInfo.endQtrYYYYQ || "20214";
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: param should be a string

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:15:19
   // *currently selectted* start and end quarters for the search!
 
   const firstQtr = systemInfo.startQtrYYYYQ || "20211";
-  const lastQtr = systemInfo.endQtrYYYYQ || "20214";
+  const lastQtr = true;
 
   const quarters = quarterRange(firstQtr, lastQtr);
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: param should be a string

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:15:19
   // *currently selectted* start and end quarters for the search!
 
   const firstQtr = systemInfo.startQtrYYYYQ || "20211";
-  const lastQtr = systemInfo.endQtrYYYYQ || "20214";
+  const lastQtr = systemInfo.endQtrYYYYQ && "20214";
 
   const quarters = quarterRange(firstQtr, lastQtr);
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests Fallbacks render correctly
statusReason: param should be a string

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:20:5
   const quarters = quarterRange(firstQtr, lastQtr);
 
   const localStartQuarter = localStorage.getItem(
-    "CourseOverTimeDescriptionSearch.StartQuarter",
+    "",
   );
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected '20084' to be '20211' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:24:5
   );
 
   const localEndQuarter = localStorage.getItem(
-    "CourseOverTimeDescriptionSearch.EndQuarter",
+    "",
   );
   const localSearchTerms = localStorage.getItem(
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected '20222' to be '20214' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:30:5
     "CourseOverTimeDescriptionSearch.SearchTerms",
   );
   const localStorageCheckbox =
-    localStorage.getItem("CourseOverTimeDescriptionSearch.Checkbox") === "true";
+    true;
 
   const [startQuarter, setStartQuarter] = useState(
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:30:5
     "CourseOverTimeDescriptionSearch.SearchTerms",
   );
   const localStorageCheckbox =
-    localStorage.getItem("CourseOverTimeDescriptionSearch.Checkbox") === "true";
+    false;
 
   const [startQuarter, setStartQuarter] = useState(
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected "getItem" to be called with arguments: [ Array(1) ]

Received:

  1st getItem call:

  [
-   "CourseOverTimeDescriptionSearch.Checkbox",

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:33:5
     localStorage.getItem("CourseOverTimeDescriptionSearch.Checkbox") === "true";
 
   const [startQuarter, setStartQuarter] = useState(
-    localStartQuarter || firstQtr,
+    false,
   );
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests Fallbacks render correctly
statusReason: expected '20214' to be '20211' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:33:5
     localStorage.getItem("CourseOverTimeDescriptionSearch.Checkbox") === "true";
 
   const [startQuarter, setStartQuarter] = useState(
-    localStartQuarter || firstQtr,
+    true,
   );
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected '20084' to be '20211' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:39:50
   // Stryker disable next-line all : TODO: write a good test for this or refactor
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
-  const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
+  const [searchTerms, setSearchTerms] = useState(localSearchTerms && "");
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected '' to be 'algorithms' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:39:50
   // Stryker disable next-line all : TODO: write a good test for this or refactor
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
-  const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
+  const [searchTerms, setSearchTerms] = useState(false);
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I enter search terms, the state for search terms changes
statusReason: expected 'falsealgorithms' to be 'algorithms' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:40:44
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
-  const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
+  const [checkbox, setCheckbox] = useState(true);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:40:44
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
-  const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
+  const [checkbox, setCheckbox] = useState(localStorageCheckbox && false);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:42:35
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    fetchJSON(event, { startQuarter, endQuarter, searchTerms, checkbox });
-  };
+  const handleSubmit = (event) => {};
 
   const handleSearchTermsOnChange = (event) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:47:48
     fetchJSON(event, { startQuarter, endQuarter, searchTerms, checkbox });
   };
 
-  const handleSearchTermsOnChange = (event) => {
-    setSearchTerms(event.target.value);
-  };
+  const handleSearchTermsOnChange = (event) => {};
 
   const handleCheckboxOnChange = (event) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:51:45
     setSearchTerms(event.target.value);
   };
 
-  const handleCheckboxOnChange = (event) => {
-    setCheckbox(event.target.checked);
-    localStorage.setItem(
-      "CourseOverTimeDescriptionSearch.Checkbox",
-      event.target.checked.toString(),
-    );
-  };
+  const handleCheckboxOnChange = (event) => {};
 
   const testid = "CourseOverTimeDescriptionSearchForm";
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:71:22
               quarter={startQuarter}
               setQuarter={setStartQuarter}
               controlId={"CourseOverTimeDescriptionSearch.StartQuarter"}
-              label={"Start Quarter"}
+              label={""}
             />
           </Col>
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: Unable to find a label with the text of: Start Quarter

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
