[Killed] StringLiteral
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:12:10
   const [courseJSON, setCourseJSON] = useState([]);
 
   const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/search",
+    url: "",
     params: {
       startQtr: query.startQuarter,
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
