[Killed] BlockStatement
main/components/Common/ConvertedSectionExpandableTable.jsx:17:49
 function convertToPrimaryRows(sections) {
   const groups = {};
 
-  sections.forEach(({ courseInfo, section }) => {
-    const lectureGroup = Math.floor(Number(section.section) / 100);
-    const key = `${courseInfo.quarter}-${courseInfo.courseId}-${lectureGroup}`;
-
-    if (!groups[key]) {
-      groups[key] = {
-        quarter: courseInfo.quarter,
-        courseId: courseInfo.courseId,
-        title: courseInfo.title,
-        description: courseInfo.description,
-        primary: null,
-        subRows: [],
-      };
-    }
-
-    if (section.section.endsWith("00")) {
-      groups[key].primary = section;
-    } else {
-      groups[key].subRows.push(section);
-    }
-  });
+  sections.forEach(({ courseInfo, section }) => {});
 
   return Object.values(groups).filter((group) => group.primary);
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ArithmeticOperator
main/components/Common/ConvertedSectionExpandableTable.jsx:18:37
   const groups = {};
 
   sections.forEach(({ courseInfo, section }) => {
-    const lectureGroup = Math.floor(Number(section.section) / 100);
+    const lectureGroup = Math.floor(Number(section.section) * 100);
     const key = `${courseInfo.quarter}-${courseInfo.courseId}-${lectureGroup}`;
 
killedBy: ConvertedSectionExpandableTable tests hides child rows until parent row is expanded
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:19:17
 
   sections.forEach(({ courseInfo, section }) => {
     const lectureGroup = Math.floor(Number(section.section) / 100);
-    const key = `${courseInfo.quarter}-${courseInfo.courseId}-${lectureGroup}`;
+    const key = ``;
 
     if (!groups[key]) {
killedBy: ConvertedSectionExpandableTable tests hides child rows until parent row is expanded
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionExpandableTable.jsx:21:9
     const lectureGroup = Math.floor(Number(section.section) / 100);
     const key = `${courseInfo.quarter}-${courseInfo.courseId}-${lectureGroup}`;
 
-    if (!groups[key]) {
+    if (true) {
       groups[key] = {
         quarter: courseInfo.quarter,
killedBy: ConvertedSectionExpandableTable tests hides child rows until parent row is expanded
statusReason: Unable to find an element with the text: 12591. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionExpandableTable.jsx:21:9
     const lectureGroup = Math.floor(Number(section.section) / 100);
     const key = `${courseInfo.quarter}-${courseInfo.courseId}-${lectureGroup}`;
 
-    if (!groups[key]) {
+    if (false) {
       groups[key] = {
         quarter: courseInfo.quarter,
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Cannot set properties of undefined (setting 'primary')

[Killed] ArrayDeclaration
main/components/Common/ConvertedSectionExpandableTable.jsx:28:18
         title: courseInfo.title,
         description: courseInfo.description,
         primary: null,
-        subRows: [],
+        subRows: ["Stryker was here"],
       };
     }
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionExpandableTable.jsx:32:9
       };
     }
 
-    if (section.section.endsWith("00")) {
+    if (false) {
       groups[key].primary = section;
     } else {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] MethodExpression
main/components/Common/ConvertedSectionExpandableTable.jsx:32:9
       };
     }
 
-    if (section.section.endsWith("00")) {
+    if (section.section.startsWith("00")) {
       groups[key].primary = section;
     } else {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Common/ConvertedSectionExpandableTable.jsx:34:12
 
     if (section.section.endsWith("00")) {
       groups[key].primary = section;
-    } else {
-      groups[key].subRows.push(section);
-    }
+    } else {}
   });
 
killedBy: ConvertedSectionExpandableTable tests hides child rows until parent row is expanded
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] MethodExpression
main/components/Common/ConvertedSectionExpandableTable.jsx:39:10
     }
   });
 
-  return Object.values(groups).filter((group) => group.primary);
+  return Object.values(groups);
 }
 
killedBy: ConvertedSectionExpandableTable tests ignores secondary sections without a matching primary
statusReason: Cannot read properties of null (reading 'enrollCode')

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:39:39
     }
   });
 
-  return Object.values(groups).filter((group) => group.primary);
+  return Object.values(groups).filter(() => undefined);
 }
 
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:44:12
 
 function ConvertedSectionExpandableTable({
   sections,
-  testid = "ConvertedSectionExpandableTable",
+  testid = "",
 }) {
   const convertedSections = convertToPrimaryRows(sections);
killedBy: ConvertedSectionExpandableTable tests renders with expected headers
statusReason: Unable to find an element by: [data-testid="ConvertedSectionExpandableTable"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid=""

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:48:5
 }) {
   const convertedSections = convertToPrimaryRows(sections);
   const columns = [
-    {
-      id: "expander",
-      header: ({ table }) => (
-        <button
-          data-testid={`${testid}-expand-all-rows`}
-          onClick={table.getToggleAllRowsExpandedHandler()}
-        >
-          {table.getIsAllRowsExpanded() ? "➖" : "➕"}
-        </button>
-      ),
-      cell: ({ row }) =>
-        row.getCanExpand() ? (
-          <button
-            data-testid={`${testid}-row-${row.index}-expand-button`}
-            onClick={row.getToggleExpandedHandler()}
-            style={{ cursor: "pointer" }}
-          >
-            {row.getIsExpanded() ? "➖" : "➕"}
-          </button>
-        ) : (
-          <span data-testid={`${testid}-row-${row.index}-cannot-expand`} />
-        ),
-    },
+    {},
     {
       header: "Quarter",
killedBy: ConvertedSectionExpandableTable tests renders with expected headers
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:50:15
   const columns = [
     {
       id: "expander",
-      header: ({ table }) => (
-        <button
-          data-testid={`${testid}-expand-all-rows`}
-          onClick={table.getToggleAllRowsExpandedHandler()}
-        >
-          {table.getIsAllRowsExpanded() ? "➖" : "➕"}
-        </button>
-      ),
+      header: () => undefined,
       cell: ({ row }) =>
         row.getCanExpand() ? (
killedBy: ConvertedSectionExpandableTable tests expand all button reveals child rows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-expand-all-rows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:58:13
           {table.getIsAllRowsExpanded() ? "➖" : "➕"}
         </button>
       ),
-      cell: ({ row }) =>
-        row.getCanExpand() ? (
-          <button
-            data-testid={`${testid}-row-${row.index}-expand-button`}
-            onClick={row.getToggleExpandedHandler()}
-            style={{ cursor: "pointer" }}
-          >
-            {row.getIsExpanded() ? "➖" : "➕"}
-          </button>
-        ) : (
-          <span data-testid={`${testid}-row-${row.index}-cannot-expand`} />
-        ),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:63:30
           <button
             data-testid={`${testid}-row-${row.index}-expand-button`}
             onClick={row.getToggleExpandedHandler()}
-            style={{ cursor: "pointer" }}
+            style={{ cursor: "" }}
           >
             {row.getIsExpanded() ? "➖" : "➕"}
killedBy: ConvertedSectionExpandableTable tests hides child rows until parent row is expanded
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- cursor: pointer;

[Killed] StringLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:79:20
     },
     {
       header: "CourseId",
-      accessorKey: "courseId",
+      accessorKey: "",
       cell: ({ row }) => row.original.courseId ?? "",
     },
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:80:13
     {
       header: "CourseId",
       accessorKey: "courseId",
-      cell: ({ row }) => row.original.courseId ?? "",
+      cell: () => undefined,
     },
     {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Common/ConvertedSectionExpandableTable.jsx:80:26
     {
       header: "CourseId",
       accessorKey: "courseId",
-      cell: ({ row }) => row.original.courseId ?? "",
+      cell: ({ row }) => row.original.courseId && "",
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ECE 1A -1
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:82:5
       accessorKey: "courseId",
       cell: ({ row }) => row.original.courseId ?? "",
     },
-    {
-      header: "Title",
-      accessorKey: "title",
-      cell: ({ row }) => row.original.title ?? "",
-    },
+    {},
     {
       header: "EnrollCd",
killedBy: ConvertedSectionExpandableTable tests renders with expected headers
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:85:13
     {
       header: "Title",
       accessorKey: "title",
-      cell: ({ row }) => row.original.title ?? "",
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  COMP ENGR SEMINAR
Received:

[Killed] LogicalOperator
main/components/Common/ConvertedSectionExpandableTable.jsx:85:26
     {
       header: "Title",
       accessorKey: "title",
-      cell: ({ row }) => row.original.title ?? "",
+      cell: ({ row }) => row.original.title && "",
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  COMP ENGR SEMINAR
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:90:13
     {
       header: "EnrollCd",
       accessorKey: "enrollCode",
-      cell: ({ row }) => getSectionField(row, "enrollCode"),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12583
Received:

[Killed] StringLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:90:47
     {
       header: "EnrollCd",
       accessorKey: "enrollCode",
-      cell: ({ row }) => getSectionField(row, "enrollCode"),
+      cell: ({ row }) => getSectionField(row, ""),
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12583
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:97:5
       accessorKey: "status",
       cell: ({ row }) => formatStatus(getSection(row)),
     },
-    {
-      header: "Enrolled",
-      accessorKey: "enrolled",
-      cell: ({ row }) => enrollmentFraction(row),
-    },
+    {},
     {
       header: "Days",
killedBy: ConvertedSectionExpandableTable tests renders with expected headers
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:105:13
     {
       header: "Days",
       accessorKey: "days",
-      cell: ({ row }) => formatDays(getSection(row).timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  M
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:110:13
     {
       header: "Time",
       accessorKey: "time",
-      cell: ({ row }) => formatTime(getSection(row).timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3:00 PM - 3:50 PM
Received:

[Killed] StringLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:114:20
     },
     {
       header: "Location",
-      accessorKey: "location",
+      accessorKey: "",
       cell: ({ row }) => formatLocation(getSection(row).timeLocations),
     },
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: Unable to find an element by: [data-testid="ExpandableTable-cell-row-0-col-location"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ExpandableTable"

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:115:13
     {
       header: "Location",
       accessorKey: "location",
-      cell: ({ row }) => formatLocation(getSection(row).timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  BUCHN 1930
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionExpandableTable.jsx:117:5
       accessorKey: "location",
       cell: ({ row }) => formatLocation(getSection(row).timeLocations),
     },
-    {
-      header: "Instructors",
-      accessorKey: "instructors",
-      cell: ({ row }) => formatInstructors(getSection(row).instructors),
-    },
+    {},
     {
       header: "Section",
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:120:13
     {
       header: "Instructors",
       accessorKey: "instructors",
-      cell: ({ row }) => formatInstructors(getSection(row).instructors),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  WANG L C
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionExpandableTable.jsx:125:13
     {
       header: "Section",
       accessorKey: "section",
-      cell: ({ row }) => getSectionField(row, "section"),
+      cell: () => undefined,
     },
   ];
killedBy: ConvertedSectionExpandableTable tests renders a primary row with no subrows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:
