[Killed] BooleanLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:42:5
   }
 
   const filteredSections =
-    !selectedClassroom || selectedClassroom === "ALL"
+    selectedClassroom || selectedClassroom === "ALL"
       ? courseJSON
       : courseJSON.filter(
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] EqualityOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:42:27
   }
 
   const filteredSections =
-    !selectedClassroom || selectedClassroom === "ALL"
+    !selectedClassroom || selectedClassroom !== "ALL"
       ? courseJSON
       : courseJSON.filter(
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:46:13
       ? courseJSON
       : courseJSON.filter(
           (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
-            cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
-            ),
+            true,
         );
 
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:46:13
       ? courseJSON
       : courseJSON.filter(
           (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
+            true &&
             cs.section.timeLocations.some(
               (loc) => loc.room === selectedClassroom,
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] EqualityOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:49:24
             cs.section &&
             cs.section.timeLocations &&
             cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
+              (loc) => loc.room !== selectedClassroom,
             ),
         );
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections by classroom when classroom is selected
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:49:24
             cs.section &&
             cs.section.timeLocations &&
             cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
+              (loc) => false,
             ),
         );
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections by classroom when classroom is selected
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
