[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:36:48
     localStartQuarter || firstQtr,
   );
 
-  const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
+  const [endQuarter, setEndQuarter] = useState(true);
 
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests on submit, endQuarter is the system default string from useState initializer
statusReason: expected 'boolean' to be 'string' // Object.is equality

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:36:48
     localStartQuarter || firstQtr,
   );
 
-  const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
+  const [endQuarter, setEndQuarter] = useState(localEndQuarter && lastQtr);
 
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests on submit, endQuarter is the system default string from useState initializer
statusReason: expected 'object' to be 'string' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:38:50
 
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
-  const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
+  const [searchTerms, setSearchTerms] = useState(true);
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I enter search terms, the state for search terms changes
statusReason: expected 'truealgorithms' to be 'algorithms' // Object.is equality

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:69:26
               quarters={quarters}
               quarter={startQuarter}
               setQuarter={setStartQuarter}
-              controlId={"CourseOverTimeDescriptionSearch.StartQuarter"}
+              controlId={""}
               label={"Start Quarter"}
             />
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: Found a label with the text of: Start Quarter, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
