[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:68:5
       accessorKey: "instructors",
       cell: ({ row }) => formatInstructors(row.original.section.instructors),
     },
-    {
-      header: "Description",
-      accessorKey: "description",
-      cell: ({ row }) => row.original.courseInfo.description,
-    },
+    {},
     {
       header: "Section",
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:71:13
     {
       header: "Description",
       accessorKey: "description",
-      cell: ({ row }) => row.original.courseInfo.description,
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Introductory seminar to expose students to a broad range of topics in computer engineering.
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:78:5
       accessorKey: "section",
       cell: ({ row }) => row.original.section.section,
     },
-    {
-      header: "Session",
-      accessorKey: "session",
-      cell: ({ row }) => row.original.section.session?.[5] || "",
-    },
+    {},
   ];
 
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] OptionalChaining
main/components/Common/ConvertedSectionTable.jsx:81:26
     {
       header: "Session",
       accessorKey: "session",
-      cell: ({ row }) => row.original.section.session?.[5] || "",
+      cell: ({ row }) => row.original.section.session[5] || "",
     },
   ];
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
