[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeDescriptionIndexPage.jsx:10:31
 export default function CourseOverTimeDescriptionIndexPage() {
   const [courseJSON, setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/descriptionsearch",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      searchTerms: query.searchTerms,
-      lectureOnly: query.checkbox,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: CourseOverTimeDescriptionIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(3) }
