[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:10:43
 export default function CourseOverTimeInstructorIndexPage() {
   const [courseJSON, setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/instructorsearch",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      instructor: query.instructor,
-      lectureOnly: query.checkbox,
-    },
-  });
+  const objectToAxiosParams = (query) => ({});
 
   const onSuccess = (courses) => {
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(3) }
