[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:17:32
 } from "main/utils/sectionUtils.jsx";
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
-const formatGeneralEducation = (generalEducation) =>
-  (generalEducation ?? []).map((ge) => ge.geCode.trim()).join(", ");
+const formatGeneralEducation = () => undefined;
 
 export default function GEAreaTable({ generalEducation }) {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:

[Killed] MethodExpression
main/components/GEAreas/GEAreaTable.jsx:18:40
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
 const formatGeneralEducation = (generalEducation) =>
-  (generalEducation ?? []).map((ge) => ge.geCode.trim()).join(", ");
+  (generalEducation ?? []).map((ge) => ge.geCode).join(", ");
 
 export default function GEAreaTable({ generalEducation }) {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:
  C , QNT

[Killed] LogicalOperator
main/components/GEAreas/GEAreaTable.jsx:18:4
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
 const formatGeneralEducation = (generalEducation) =>
-  (generalEducation ?? []).map((ge) => ge.geCode.trim()).join(", ");
+  (generalEducation && []).map((ge) => ge.geCode.trim()).join(", ");
 
 export default function GEAreaTable({ generalEducation }) {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Cannot read properties of undefined (reading 'map')
