[Killed] BlockStatement
main/components/GEAreas/GEAreaTable.jsx:17:54
 } from "main/utils/sectionUtils.jsx";
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
-const formatGeneralEducation = (generalEducation) => {
-  if (!generalEducation || generalEducation.length === 0) {
-    return "";
-  }
-
-  return generalEducation
-    .map((ge) => ge.geCode?.trim())
-    .filter(Boolean)
-    .join(", ");
-};
+const formatGeneralEducation = (generalEducation) => {};
 
 export default function GEAreaTable({ generalEducation }) {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:

[Killed] BlockStatement
main/components/GEAreas/GEAreaTable.jsx:18:59
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
 const formatGeneralEducation = (generalEducation) => {
-  if (!generalEducation || generalEducation.length === 0) {
-    return "";
-  }
+  if (!generalEducation || generalEducation.length === 0) {}
 
   return generalEducation
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
main/components/GEAreas/GEAreaTable.jsx:18:28
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
 const formatGeneralEducation = (generalEducation) => {
-  if (!generalEducation || generalEducation.length === 0) {
+  if (!generalEducation || generalEducation.length !== 0) {
     return "";
   }
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:

[Survived] MethodExpression
main/components/GEAreas/GEAreaTable.jsx:22:10
     return "";
   }
 
-  return generalEducation
-    .map((ge) => ge.geCode?.trim())
-    .filter(Boolean)
+  return generalEducation.map(ge => ge.geCode?.trim())
     .join(", ");
 };

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:23:10
   }
 
   return generalEducation
-    .map((ge) => ge.geCode?.trim())
+    .map(() => undefined)
     .filter(Boolean)
     .join(", ");
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:

[Killed] MethodExpression
main/components/GEAreas/GEAreaTable.jsx:23:18
   }
 
   return generalEducation
-    .map((ge) => ge.geCode?.trim())
+    .map((ge) => ge.geCode)
     .filter(Boolean)
     .join(", ");
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:
  C , QNT

[Killed] ArrowFunction
main/components/GEAreas/GEAreaTable.jsx:82:13
     {
       header: "GE Areas",
       id: "generalEducation",
-      cell: ({ row }) => formatGeneralEducation(row.original.generalEducation),
+      cell: () => undefined,
     },
     {
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C, QNT
Received:

[Killed] StringLiteral
main/components/GEAreas/GEAreaTable.jsx:106:15
     },
     {
       id: "time",
-      header: "Time",
+      header: "",
       cell: ({ row }) => formatTime(getSection(row).timeLocations),
     },
killedBy: GEAreaTable tests has the expected column headers expand toggles and formatted cells
statusReason: Unable to find an accessible element with the role "columnheader" and name "Time"

Here are the accessible roles:

  table:

  Name "":
  <table
